export const BaoAnMenu = [
  {
    viewCode: 'BAOAN1',
    viewName: 'V2G放电',
    viewOrder: 1,
    viewInfoType: 'B1',
    viewInfo: '[487540.39375, 2495689.155625, 114.129453, -11.331269, -130.678253]',
    isHover: false,
    icon: 'device',
    iconIdList: null,
    secondMenuList: null
  },
  {
    viewCode: 'BAOAN2',
    viewName: '能源消纳',
    viewOrder: 3,
    viewInfoType: 'B2',
    viewInfo: '[487452.44625, 2495775.650625, 248.937539, -45.69075, -128.479538]',
    isHover: false,
    icon: 'electric',
    iconIdList: null,
    secondMenuList: null
  },
  {
    viewCode: 'BAOAN3',
    viewName: '视角漫游',
    viewOrder: 5,
    viewInfoType: 'B3',
    viewInfo:
      '[[ 0,\n    1.0,\n    [504737.464062, 2499780.079063, 149.31584],\n    [ -35.954727, 105.706551, 0]],[1,\n    4.0,\n    [504747.047891, 2499758.591563, 149.31584],\n    [-35.954727, 105.706551, 0]],[2,\n    8.0,\n    [504771.814688, 2499737.946875, 150.298164],\n    [-37.208004, 120.48587, 0]],[3,\n    12.0,\n    [504797.087109, 2499695.925625, 151.758936],\n    [-38.994564, 147.295731, 0]],[4,\n    16.0,\n    [504817.640391, 2499660.328438, 151.758936],\n    [-38.994564, 147.295731, 0]],[5,\n    20.0,\n    [504832.197656, 2499641.425625, 145.826396],\n    [-31.676046, 157.183762, 0]],[ 6,\n    24.0,\n    [504835.158516, 2499594.385938, 148.687803],\n    [-34.917603, -172.190582, 0]],[ 7,\n    30.0,\n    [504830.331992, 2499562.277188, 146.482559],\n    [-32.392376, -166.592697, 0]]]',
    isHover: false,
    icon: 'camera',
    iconIdList: null,
    secondMenuList: null
  }
];
