export const busLineList = [
  {
    name: '公交1号线',
    id: 'bus_1',
    assetPath: '/JC_CustomAssets/VehicleLibrary/Exhibition/能源_公交车_0',
    path: [
      [484305.4925, 2501206.88, 34.21],
      [487222.1925, 2502804.96, 28.795],
      [483587.25, 2507789, 0],
      [487478.5825, 2509267.68, 126.22500000000001],
      [491477.9, 2509437.92, 44.2]
    ],
    rotation: [0, 70, 0]
  },
  {
    name: '公交2号线',
    id: 'bus_2',
    assetPath: '/JC_CustomAssets/VehicleLibrary/Exhibition/能源_公交车_1',
    path: [
      [497922.405, 2492292.16, 3.065],
      [497973.67375, 2494187.2, 31.052500000000002],
      [499586.23125, 2494579.52, 39.96],
      [502486.0125, 2493652.64, 8.4575]
    ],
    rotation: [0, 80, 0],
    isHighLight: true
  },
  {
    name: '公交3号线',
    id: 'bus_3',
    assetPath: '/JC_CustomAssets/VehicleLibrary/Exhibition/能源_公交车_2',
    path: [
      [501714.84375, 2505745.25, 70.56999969482422],
      [506503.660625, 2505425.44, 75.8925],
      [510776.8325, 2501904.32, 46.4775],
      [512269.95625, 2495370.24, 8.52]
    ],
    rotation: [0, 100, 0]
  }
];
